In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.4.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.7/11.7 MB 710.0 kB/s eta 0:00:0000:0100:01
Requirement already satisfied: numpy>=1.18.5 in /usr/local/lib/python3.8/dist-packages (from pandas) (1.22.4)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.8/dist-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.1-py2.py3-none-any.whl (503 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 503.5/503.5 kB 511.9 kB/s eta 0:00:00a 0:00:01
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.8/dist-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.4.2 pytz-2022.1
WARNING: Running pip as the 'root' user can result in broken permissions and conflicting behaviour with the system package manager. It is recommended to use a virtual environment instead: https://pip.pypa.io/warnings/venv

In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
WORKING_DIRECTORY = os.getcwd()
print(WORKING_DIRECTORY)

/tf/notebooks/missing_data

In [4]:
os.listdir(WORKING_DIRECTORY)

['.DS_Store', '.ipynb_checkpoints', 'Notebook.ipynb', 'data.csv']

In [5]:
DATA_FILE = f'{WORKING_DIRECTORY}/data.csv'

In [6]:
df = pd.read_csv(DATA_FILE)

In [7]:
df.head()

               V1    V2     V3     V4
0    Lisa Johnson   4.0   8.77    NaN
1       John Reed  21.0  12.23  28.57
2  Bethany Garcia   6.0  13.53  85.43
3    Austin Woods   NaN    NaN  42.92
4  Troy Carpenter  35.0  13.95  98.36

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      97 non-null     object
 1   V2      95 non-null     float64
 2   V3      96 non-null     float64
 3   V4      94 non-null     float64
dtypes: float64(3), object(1)
memory usage: 3.2+ KB

In [9]:
pd.isna(df['V4'])

0      True
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: V4, Length: 100, dtype: bool

In [10]:
list(pd.isna(df['V4'])).count(True)

6

In [11]:
{col: list(pd.isna(df[col])).count(True) for col in df.columns}

{'V1': 3, 'V2': 5, 'V3': 4, 'V4': 6}

In [12]:
df[pd.isna(df['V1'])]

     V1    V2     V3     V4
10  NaN  43.0   0.00  56.69
66  NaN  16.0  13.72  99.73
87  NaN   1.0  13.62  39.59

In [13]:
df[pd.isna(df['V3'])]

              V1    V2  V3     V4
3   Austin Woods   NaN NaN  42.92
40    Lisa Smith  22.0 NaN  99.73
64  Warren Banks  35.0 NaN  46.43
83   Sheena Tran   5.0 NaN  88.47

In [14]:
list(pd.isna(df).any(axis=1)).count(False)

83

In [15]:
complete_df = df[~pd.isna(df).any(axis=1)].reset_index(drop=True)
complete_df.head()

                V1    V2     V3     V4
0        John Reed  21.0  12.23  28.57
1   Bethany Garcia   6.0  13.53  85.43
2   Troy Carpenter  35.0  13.95  98.36
3       Ryan Moody  50.0  10.88  54.39
4  Alexandra Davis   8.0   9.81  83.71

In [16]:
complete_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      83 non-null     object
 1   V2      83 non-null     float64
 2   V3      83 non-null     float64
 3   V4      83 non-null     float64
dtypes: float64(3), object(1)
memory usage: 2.7+ KB

In [17]:
incomplete_df = df[pd.isna(df).any(axis=1)].reset_index(drop=True)
incomplete_df

                 V1    V2     V3     V4
0      Lisa Johnson   4.0   8.77    NaN
1      Austin Woods   NaN    NaN  42.92
2   Melissa Sanchez  23.0  18.45    NaN
3               NaN  43.0   0.00  56.69
4     Terri Johnson   NaN  18.10  51.50
5        Lisa Smith  22.0    NaN  99.73
6      Lisa Barajas   NaN  13.16  97.16
7        Tammy Webb  39.0   5.31    NaN
8      Warren Banks  35.0    NaN  46.43
9               NaN  16.0  13.72  99.73
10   Kathryn Weaver  10.0  15.57    NaN
11     Ashley Green   NaN   5.20  44.83
12    Kelly Nichols   0.0   2.31    NaN
13      Sheena Tran   5.0    NaN  88.47
14              NaN   1.0  13.62  39.59
15    Susan Jimenez  19.0  18.29    NaN
16   Barbara Cannon   NaN   6.79  22.40

In [18]:
incomplete_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      14 non-null     object
 1   V2      12 non-null     float64
 2   V3      13 non-null     float64
 3   V4      11 non-null     float64
dtypes: float64(3), object(1)
memory usage: 672.0+ bytes

In [54]:
treatment = {
    'V1': 'Unknown',
    'V2': 0.0,
    'V3': round(np.nanmean(df['V3']), 2),
    'V4': round(np.nanmedian(df['V4']), 2)
}

In [55]:
treatment

{'V1': 'Unknown', 'V2': 0.0, 'V3': 10.49, 'V4': 57.08}

In [56]:
treated_df = df.fillna(value=treatment)
treated_df.head(10)

                  V1    V2     V3     V4
0       Lisa Johnson   4.0   8.77  57.08
1          John Reed  21.0  12.23  28.57
2     Bethany Garcia   6.0  13.53  85.43
3       Austin Woods   0.0  10.49  42.92
4     Troy Carpenter  35.0  13.95  98.36
5         Ryan Moody  50.0  10.88  54.39
6    Alexandra Davis   8.0   9.81  83.71
7    Melissa Sanchez  23.0  18.45  57.08
8   Danielle Rollins  46.0   2.91  91.86
9  Alexander Stevens   7.0   7.33  81.82

In [57]:
treated_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      100 non-null    object
 1   V2      100 non-null    float64
 2   V3      100 non-null    float64
 3   V4      100 non-null    float64
dtypes: float64(3), object(1)
memory usage: 3.2+ KB